app/Controllers/Cliente.php

SELECT *
FROM `clientes`
---
    public function index()
    {

        $data = $this->clienteM->findAll();

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '8'
---
    public function edit($id)
    {
        //estanciar
        $clienteModel = new ClienteModel();
        //add em dados busca oi 1 id
        $dados = $clienteModel->find($id);

DELETE FROM `clientes`
WHERE `id` IN ('15')
---
    public function delete($id)
    {
      //estanciar
      $clienteModel = new ClienteModel();
      //add em dados busca oi 1 id
      if ($clienteModel->delete($id)) {